title: MSHTA Execution of Script From Downloads Folder
id: d7f14b30-e346-48bf-a123-9021fa435578
status: experimental
description: Detects mshta.exe executing a potentially malicious HTA file located in the user's Downloads directory.
date: 2025/12/28
references: malwarebazaar
sha: 2e5934e38666e63c23f5906e5175a1bf5c230972cb57bb8c07dab0630921fa43
    
logsource:
    product: windows
    service: sysmon
    category: process_creation
detection:
    selection_image:
        Image|endswith: '\mshta.exe'
        OriginalFileName: 'MSHTA.EXE'
    selection_path:
        CommandLine|contains: '\Users\'
        CommandLine|contains: '\Downloads\'
    selection_extension:
        CommandLine|contains: '.hta'
    selection_args:
        # Detects the specific GUID-like arguments used for decryption/logic
        CommandLine|re: '.*\{[A-F0-9]{8}-[A-F0-9]{4}-[A-F0-9]{4}-[A-F0-9]{4}-[A-F0-9]{12}\}.*'
    condition: all of selection_*

fields:
    - ComputerName
    - User
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Rare administrative tools that use HTA for local GUI (unlikely in Downloads folder).
level: critical